Lab04/lab4/solution/ReqBody.txt

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Body><sum xmlns="http://pys/"><msu1 xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><s>edrft</s><k>1</k><f>1.2</f></msu1><msu2 xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><s>edf</s><k>1</k><f>2.1</f></msu2></sum></s:Body></s:Envelope>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Body><sum xmlns="http://pys/"><msu1 xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><s>dfghj</s><k>1</k><f>1.2</f></msu1><msu2 xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><s>cvbn</s><k>1</k><f>2.1</f></msu2></sum></s:Body></s:Envelope>
<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><sum xmlns="http://pys/"><msu1><s>sdfgh</s><k>3</k><f>3.5</f></msu1><msu2><s>sdfgh</s><k>5</k><f>5.6</f></msu2></sum></soap:Body></soap:Envelope>
